<a href="https://colab.research.google.com/github/sagarsitap596/gcolab_python/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
?pd

0.24.2

Pandas Series

In [0]:
s3 = pd.Series({'sagar':11,'ravi':'22'})
print(s3.name)
print(s3.dtype)
print(s3.index)
print(s3.itemsize)
print(s3.nbytes)

print("="*20)


s1=pd.Series(data=[1,1.1,'1.123',1+1j],index=['int','float','String','complex'])
print(s1.dtype)
print(s1.index)

print(s1.itemsize)
print(s1.nbytes)

print("="*20)

s2 = pd.Series(range(5))
print(s2.dtype)
print(s2.index)

print("="*20)

s2=s2.append(pd.Series(range(6,11)))
print(s2)

None
object
Index(['sagar', 'ravi'], dtype='object')
8
16
====================
object
Index(['int', 'float', 'String', 'complex'], dtype='object')
8
32
====================
int64
RangeIndex(start=0, stop=5, step=1)
====================
0     0
1     1
2     2
3     3
4     4
0     6
1     7
2     8
3     9
4    10
dtype: int64

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: FutureWarning: Series.itemsize is deprecated and will be removed in a future version
  """
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:15: FutureWarning: Series.itemsize is deprecated and will be removed in a future version
  from ipykernel import kernelapp as app

In [0]:
#Accessing elements
ser1= pd.Series([1,2,3,4,5,6,7,8,9,10],index=['e','f','g','h','i','j','a','b','c','d'])
print(ser1)
print("1st element             : {}".format(ser1[0]))
print("3rd element             : {}".format(ser1[2]))
print("by list of index [2,7,9]: \n{}".format(ser1[[2,7,9]]))      
print("index a's value element : {}".format(ser1['a']))
print("index g's value element : {}".format(ser1['g']))
print("by list of clolumns     :  \n{}".format(ser1[['a','b','g','h']]))

print("slicing Series from 3 to 8 : \n{}".format(ser1[3:9]))

print("slicing Series from f to c : \n{}".format(ser1['f':'c']))

 # cause error bcz python needs index in increasing or decreasing order. 
    
print("slicing Series from c to f : \n{}".format(ser1['c':'z']))

e     1
f     2
g     3
h     4
i     5
j     6
a     7
b     8
c     9
d    10
dtype: int64
1st element             : 1
3rd element             : 3
by list of index [2,7,9]:
g     3
b     8
d    10
dtype: int64
index a's value element : 7
index g's value element : 3
by list of clolumns     :
a    7
b    8
g    3
h    4
dtype: int64
slicing Series from 3 to 8 :
h    4
i    5
j    6
a    7
b    8
c    9
dtype: int64
slicing Series from f to c :
f    2
g    3
h    4
i    5
j    6
a    7
b    8
c    9
dtype: int64

KeyError: ignored

In [0]:
 DataFrame hands on

In [0]:

import pandas as pd

df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
print(df)
print("="*30)
d1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=np.array(['a','b','c'],dtype=str),columns=['x','y','z'])
print(d1)
print("="*30)
d2 = pd.DataFrame([{"col1": 1,"col2": 2,"col4": 3},{"col1": 11,"col2": 22,"col3": 33},{"col1": 111,"col2": 222,"col3": 333}],index = ['a','b','c'])
print(d2)
print("="*30)
d3 = pd.DataFrame({"col1": [1,11,11],"col2": [2,2,22],"col3": [3,33,333]},index = ['a','b','c'])
print(d3)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
==============================
   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9
==============================
   col1  col2   col3  col4
a     1     2    NaN   3.0
b    11    22   33.0   NaN
c   111   222  333.0   NaN
==============================
   col1  col2  col3
a     1     2     3
b    11     2    33
c    11    22   333

In [0]:
import numpy as np
import pandas as pd


print(df)
print(f"Shape of dataframe : {df.shape}")
print(f"Dimensions of dataframe : {df.ndim}")
print(f"Shape of size : {df.size}")

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
Shape of dataframe : (3, 3)
Dimensions of dataframe : 2
Shape of size : 9

In [0]:

df2 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=np.array(['a','b','c'],dtype=str),columns=['x','y','z'])
print(df2)
print(f"Shape : {df2.shape}")
print(f"Index : {df2.index}")
print(f"Columns : {df2.columns}")

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9
Shape : (3, 3)
Index : Index(['a', 'b', 'c'], dtype='object')

Outer and inner index

In [0]:
outerIndex = ['G!']*3+['G2']*3 # creates list of G1 three times + G2 three times
innerIndex = range(1,7)

hierarchicalIndex = list(zip(outerIndex,innerIndex))
hierarchicalIndex = pd.MultiIndex.from_tuples(hierarchicalIndex)
print(f"final Index : {hierarchicalIndex}")

df3 = pd.DataFrame(np.random.randn(6,2),index = finalIndex, columns = ['x','y'])

print(df3)

print(f"Shape : {df3.shape}")
print(f"Size : {df3.size}")
print(f"Index : {df3.index}")

final Index : MultiIndex(levels=[['G!', 'G2'], [1, 2, 3, 4, 5, 6]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 3, 4, 5]])
                x         y
(G!, 1) -1.423957  0.807044
(G!, 2) -0.956280 -0.189248
(G!, 3) -0.625043  1.398826
(G2, 4)  0.773050 -0.610745
(G2, 5)  0.005245  0.305910
(G2, 6)  0.545901  0.861152
Shape : (6, 2)
Size : 12
Index : Index([('G!', 1), ('G!', 2), ('G!', 3), ('G2', 4), ('G2', 5), ('G2', 6)], dtype='object')

Accessing data from DAtaFrame

In [0]:
d3 = pd.DataFrame({"col1": [1,11,11],"col2": [2,2,22],"col3": [3,33,333]},index = ['a','b','c'])
print(d3,end="\n"+"="*30+"\n")

col1 = d3['col1']
print(col1,end="\n"+"="*30+"\n")
print(type(col1),end="\n"+"="*30+"\n")
col1_2 = d3[['col1','col3']]
print(col1_2,end="\n"+"="*30+"\n")
print(type(col1_2),end="\n"+"="*30+"\n")

   col1  col2  col3
a     1     2     3
b    11     2    33
c    11    22   333
==============================
a     1
b    11
c    11
Name: col1, dtype: int64
==============================
<class 'pandas.core.series.Series'>
==============================
   col1  col3
a     1     3
b    11    33
c    11   333
==============================
<class 'pandas.core.frame.DataFrame'>
==============================

Pandas loc function : accessing based on lables (index and columns)
range is inclusive of end.

In [0]:
d3 = pd.DataFrame({"col1": [1,11,111],"col2": [2,22,222],"col3": [3,33,333]},index = ['a','b','c'])
print(d3,end="\n"+"="*30+"\n")

d3.loc['b','col2']

   col1  col2  col3
a     1     2     3
b    11    22    33
c   111   222   333
==============================

22

In [0]:
d3.loc['a':'c','col1':'col3']

   col1  col2  col3
a     1     2     3
b    11    22    33
c   111   222   333

In [0]:
# condition
d3.loc[d3.col2 > 10,:] # All rows having col2 value > 10

   col1  col2  col3
b    11    22    33
c   111   222   333

In [0]:
d3.loc[(d3.col2 > 10) & (d3.col2 < 30),:] # All rows having col2 value > 10

   col1  col2  col3
b    11    22    33

Pandas iloc function : accessing based on index number (row index number and columns index number) range is exclusive of end.

In [0]:
d3.iloc[2,2]

333

In [0]:
d3.iloc[1:2,1:3]

   col2  col3
b    22    33

In [0]:
# condition
d3[d3.iloc[:,1] > 10] # All rows having col2 value > 10

   col1  col2  col3
b    11    22    33
c   111   222   333

In [0]:
d3[(d3.iloc[:,1] > 10) & (d3.iloc[:,1] < 30)]

   col1  col2  col3
b    11    22    33

Renaming column name

In [0]:
d3.rename(index = {'c':'c_renamed'},columns={'col3': 'col3_renamed'},inplace=True)
d3

           col1  col2  col3_renamed
c_renamed   111   222           333
b            11    22            33
a             1     2             3

Add columns

In [0]:
# d3 = d3.assign(col_New3 = d3['col2']+2000 )   OR
d3['col_New2']=d3['col2']+2000
d3

   col1  col2  col3
c   111   222   333
b    11    22    33
a     1     2     3

Dropping columns

In [0]:
d3.drop(labels=['col_New2'],axis=1,inplace=True)
d3

     col1    col2  col3_renamed  col_New1
0     1.0     2.0           3.0    1002.0
1    11.0    22.0          33.0    1022.0
2   111.0   222.0         333.0    1222.0
3  1111.0  2222.0        3333.0   12222.0
4  1111.0  2222.0           NaN   12222.0
5     NaN     NaN           NaN       NaN
6     NaN     NaN           NaN       NaN
7     NaN     NaN           NaN       NaN
8     NaN     NaN           NaN       NaN

Adding row

In [0]:
# df = pd.DataFrame([[1,2,3],[4,5,6],[6,7,8]], index = ['a','b','c'],columns=['c1','c2','c3'])
# print(df)
# print("="*30)

# # Add new row as DataFrame without index
# df1 = pd.DataFrame([[9,10,11]],columns = df.columns)
# print(df.append(df1))
# print("="*30)

# # Add new row as Dataframe with index
# df1 = pd.DataFrame([[12,13,14]],index=['d'],columns = df.columns)
# print(df.append(df1))
# print("="*30)

# # Add new row as Series with index
# # In this case ignore_index=True is required. And index is columns in DataFrame
# s1 = pd.Series([15,16,17],index=['c1','c2','c3'])
# print(df.append(s1,ignore_index=True))
# print("="*30)


# print(df.append([[18,19,20]]))
# print("="*30)

d3 = d3.append(pd.DataFrame([[1111,2222,np.NaN,12222]],columns=d3.columns),ignore_index=True)

     col1    col2  col3_renamed  col_New1
0     1.0     2.0           3.0    1002.0
1    11.0    22.0          33.0    1022.0
2   111.0   222.0         333.0    1222.0
3  1111.0  2222.0        3333.0   12222.0
6  1111.0  2222.0           NaN   12222.0

Dropping rows

In [0]:
#Dropping rows by index
# d3.drop(axis=0,index=[4,5],inplace=True)

print("="*30)
#Dropping rows having NaN values
d3.dropna(inplace=True)
print(d3)

     col1    col2  col3_renamed  col_New1
0     1.0     2.0           3.0    1002.0
1    11.0    22.0          33.0    1022.0
2   111.0   222.0         333.0    1222.0
3  1111.0  2222.0        3333.0   12222.0
4  1111.0  2222.0           NaN   12222.0
==============================
     col1    col2  col3_renamed  col_New1
0     1.0     2.0           3.0    1002.0
1    11.0    22.0          33.0    1022.0
2   111.0   222.0         333.0    1222.0
3  1111.0  2222.0        3333.0   12222.0

Sorting

In [0]:
# d3.sort_values(by='col1',ascending=False) OR
d3['col1'].sort_values(ascending=False)

d3.sort_values('col1',ascending=False,inplace=True)
d3

   col1  col2  col3
c   111   222   333
b    11    22    33
a     1     2     3

In [0]:
data = pd.DataFrame({'Country': ['Russia','Colombia','Chile','Equador','Nigeria'],
                    'Rank':[121,40,100,130,11],
                    'Rank2':[1,2,3,4,5]})
data.describe()

             Rank     Rank2
count    5.000000  5.000000
mean    80.400000  3.000000
std     52.300096  1.581139
min     11.000000  1.000000
25%     40.000000  2.000000
50%    100.000000  3.000000
75%    121.000000  4.000000
max    130.000000  5.000000

===================================================================================

In [0]:
data = pd.DataFrame({'group':['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [0]:
#Sort based on two columns

data.sort_values(by=['group','ounces'],ascending=[False,True])

  group  ounces
6     c     3.0
7     c     5.0
8     c     6.0
3     b     6.0
4     b     7.5
5     b     8.0
1     a     3.0
0     a     4.0
2     a    12.0

Drop duplicate rows

In [0]:
data = data.append(pd.Series(['c',3.0],index=['group','ounces']),ignore_index=True)
data = data.append(pd.DataFrame([['b',8.0]],columns=data.columns))
data.sort_values(by=['group'])

# Drop rows if all columns values are duplicate
print(data.drop_duplicates())

# Drop rows if group columns values are duplicate
print(data.drop_duplicates(subset='group'))

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0
  group  ounces
0     a     4.0
3     b     6.0
6     c     3.0

In [0]:
data

   group  ounces
0      a     4.0
1      a     3.0
2      a    12.0
3      b     6.0
4      b     7.5
5      b     8.0
6      c     3.0
7      c     5.0
8      c     6.0
9      c     3.0
10     b     8.0
11     c     3.0
12     b     8.0
13     c     3.0
14     b     8.0
15     c     3.0
0      b     8.0

In [3]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami','corned beef', 'Bacon', 'pastrami', 'honey ham','nova lox'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Create new column animal corresponding to each food item ==> using map function

In [4]:
# Using map function - map values to different set of values

meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [17]:
# Using function in apply()

def meat_to_animal_f(series):
  if series['food'] == 'bacon':
    return 'pig'
  elif series['food'] == 'pulled pork':
    return 'pig'
  elif series['food'] == 'pastrami':
    return 'cow'
  elif series['food'] == 'corned beef':
    return 'cow'
  elif series['food'] == 'honey ham':
    return 'pig'
  else:
    return 'salmon'

def meat_to_animal_f_onSeries(food):
  if food == 'bacon':
    return 'pig'
  elif food == 'pulled pork':
    return 'pig'
  elif food == 'pastrami':
    return 'cow'
  elif food == 'corned beef':
    return 'cow'
  elif food == 'honey ham':
    return 'pig'
  else:
    return 'salmon'  
  
  
 
print(data,end="\n"+"="*50+"\n")

#apply function on Data frame requires axis attribute
# data.apply(meat_to_animal_f,axis=1)

# apply function onnSeries 
data['food'].apply(meat_to_animal_f_onSeries)

# data['food'] = data['food'].apply(lower)
# data['animal2'] = data.apply(meat_to_animal_f,axis=1)
# data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon
==================================================

0       pig
1       pig
2       pig
3    salmon
4       cow
5    salmon
6       cow
7       pig
8    salmon
Name: food, dtype: object

Pivot

In [0]:
sm=pd.DataFrame({'Name':['sagar','nitin','amar','ravi','shyam','ram','vivek'],
                 'Category':['c1','c1','c2','c2','c2','c2','c1'],
                 'Maths':[50,30,20,70,80,-1,45],
                 'Science':[80,50,40,90,30,55,-1],
                 'Is_Sportsman':[True,False,False,True,True,True,True]})
sm

    Name Category  Maths  Science  Is_Sportsman
0  sagar       c1     50       80          True
1  nitin       c1     30       50         False
2   amar       c2     20       40         False
3   ravi       c2     70       90          True
4  shyam       c2     80       30          True
5    ram       c2     -1       55          True
6  vivek       c1     45       -1          True

Conditional filter

In [0]:
# Student with Maths Marks > 50
sm[sm['Maths'] > 50]

    Name Category  Maths  Science  Is_Sportsman
3   ravi       c2     70       90          True
4  shyam       c2     80       30          True

In [0]:
# Student with Science Marks > 50 < 70
sm[(sm['Science'] > 30) & (sm['Science'] < 70)]

    Name Category  Maths  Science  Is_Sportsman
1  nitin       c1     30       50         False
2   amar       c2     20       40         False
5    ram       c2     -1       55          True

In [0]:
sm[sm['Science'].isin([30,70,50,40])]

    Name Category  Maths  Science  Is_Sportsman
1  nitin       c1     30       50         False
2   amar       c2     20       40         False
4  shyam       c2     80       30          True

In [0]:
# Sports Student having highest Maths marks
sm[sm['Is_Sportsman']].sort_values(by='Maths',ascending=False).iloc[0]['Name']

'shyam'

In [0]:
# which category has more number of students
sm['Category'].value_counts().idxmax()

'c2'

In [0]:
# which category has sports student with highest maths marks
sm[sm['Is_Sportsman']].sort_values(by='Maths',ascending=False)['Category'].iloc[0,]

'c2'

In [0]:
# Which category has highest mean Science marks

In [0]:
int_df = sm.select_dtypes(include='int')

int_df[int_df < 0] = np.NaN

sm[int_df.columns] = int_df

sm

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:3414: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._where(-key, value, inplace=True)

    Name Category  Maths  Science  Is_Sportsman
0  sagar       c1   50.0     80.0          True
1  nitin       c1   30.0     50.0         False
2   amar       c2   20.0     40.0         False
3   ravi       c2   70.0     90.0          True
4  shyam       c2   80.0     30.0          True
5    ram       c2    NaN     55.0          True
6  vivek       c1   45.0      NaN          True

In [0]:
# Grouping

# find median of Maths marks by category

sm.groupby('Category')[['Science']].median()

# sm.groupby('Category')[['Science']].count()
# sm.groupby('Category')[['Science']].sum()
# sm.groupby('Category')[['Science']].mean()
# sm.groupby('Category')[['Science']].min()
# sm.groupby('Category')[['Science']].max()
# sm.groupby('Category')[['Science']].median()
# sm.groupby('Category')[['Science']].std()

          Science
Category
c1           65.0
c2           47.5

In [0]:
# Which category has lowest median of Maths marks

sm.groupby('Category')[['Science']].median().sort_values(by='Science', ascending=True).idxmin()[0]

'c2'

In [0]:
# find median of  science marks of sports and non sports students  for every category

# same can be done using pivot_table.

sm.groupby(['Category','Is_Sportsman'])[['Science']].median()

                       Science
Category Is_Sportsman
c1       False            50.0
         True             39.5
c2       False            40.0
         True             55.0

          Science
Category
c1              3
c2              4

In [0]:
# get uniqueue categories

sm['Category'].unique()

array(['c1', 'c2'], dtype=object)

In [0]:
# get uniqueue count categories

sm['Category'].nunique()

2

Pivot

pandas.pivot(data, columns, index,values, aggfunc)

-data: dataframe to be used for pivot operation

-columns: Keys to group by on pivot table column

-index: column/array to groupby our data (Will be displayed in the index column (or -columns, if you're passing in a list)

-values (optional): Column to aggregate (If we do not specify this then the function   will aggregate all numeric columns)

-aggfunc: Functions to be applied to for every group (by default computes mean)

In [0]:

pd.pivot_table(sm,index=['Category','Is_Sportsman'],values='Maths',aggfunc='sum')

                       Maths
Category Is_Sportsman
c1       False            30
         True             95
c2       False            20
         True            149

Merge


The syntax is pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=True) where:

- left: dataframe
- right: dataframe
- on: Columns (names) to join on. Must be found in both the left and right DataFrame       objects.
- left_on: Columns from the left DataFrame to use as keys (can either be column                names or arrays with length equal to the length of the DataFrame).
- right_on: Columns from the right DataFrame to use as keys (can either be column               names or arrays with length equal to the length of the DataFrame).
- left_index: If True, use the index (row labels) from the left DataFrame as its                   join key(s). In case of a DataFrame with a MultiIndex (hierarchical),               the number of levels must match the number of join keys from the right               DataFrame.
- right_index: Same usage as left_index for the right DataFrame.
- how: One of 'left', 'right', 'outer', 'inner'. Defaults to 'inner'
- sort: Sort the result DataFrame by the join keys in lexicographical order.         Defaults to True.

In [0]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'product': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

print(df1)
print("="*30)
print(df2)
print("="*30)

# Code starts here

merged = pd.merge(df1,df2,left_on=['fruit','weight'],
                  right_on=['product', 'kilo'],
                  how='inner',
                  left_index=True,
                  suffixes=['_left', '_right'])
print(merged)

    fruit  weight  price
0   apple    high      3
1  banana  medium      4
2  orange     low     13
3   apple    high      9
4  banana  medium      1
5  orange     low     13
6   apple    high      7
7  banana  medium     11
8  orange     low      9
==============================
  product  kilo  price
0   apple  high      2
1  orange   low      6
2    pine  high      6
3   apple   low      1
4  orange  high      7
5    pine   low      3
==============================
    fruit  weight  price_left product  kilo  price_right
0   apple    high           3   apple  high          2.0
5  banana  medium           4     NaN   NaN          NaN
1  orange     low          13  orange   low          6.0
0   apple    high           9   apple  high          2.0
5  banana  medium           1     NaN   NaN          NaN
1  orange     low          13  orange   low          6.0
0   apple    high           7   apple  high          2.0
5  banana  medium          11     NaN   NaN          NaN
1  orange     low           9  orange   low          6.0